Repository: whit3rabbit/turbospark
Catalog: swift/TurboSparkApp/Localization/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, he, hi, id, it, ja, ko, nl, pl, pt_br, ru, sv, tr, uk, vi, zh_hans, zh_hant

source: Clear Chat History
ar: مسح سجل المحادثة
de: Chatverlauf löschen
es: Borrar historial del chat
fr: Effacer l'historique de discussion
he: נקה היסטוריית צ'אט
hi: चैट इतिहास साफ़ करें
id: Hapus riwayat obrolan
it: Cancella cronologia chat
ja: チャット履歴を消去
ko: 대화 기록 지우기
nl: Chatgeschiedenis wissen
pl: Wyczyść historię czatu
pt_br: Limpar histórico do chat
ru: Очистить историю чата
sv: Rensa chatthistorik
tr: Sohbet geçmişini temizle
uk: Очистити історію чату
vi: Xóa lịch sử trò chuyện
zh_hans: 清空对话记录
zh_hant: 清除對話記錄

source: Clear chat history
ar: مسح سجل المحادثة
de: Chatverlauf loeschen
es: Borrar historial del chat
fr: Effacer l'historique de discussion
he: נקה היסטוריית צ'אט
hi: चैट इतिहास साफ़ करें
id: Hapus riwayat obrolan
it: Cancella cronologia chat
ja: チャット履歴を消去
ko: 대화 기록 지우기
nl: Chatgeschiedenis wissen
pl: Wyczyść historię czatu
pt_br: Limpar histórico do chat
ru: Очистить историю чата
sv: Rensa chatthistorik
tr: Sohbet geçmişini temizle
uk: Очистити історію чату
vi: Xóa lịch sử trò chuyện
zh_hans: 清空对话记录
zh_hant: 清除對話記錄

source: Clear filters
ar: مسح عوامل التصفية
de: Filter zurücksetzen
es: Borrar filtros
fr: Effacer les filtres
he: נקה מסננים
hi: फ़िल्टर साफ़ करें
id: Hapus filter
it: Cancella filtri
ja: フィルターをクリア
ko: 필터 지우기
nl: Filters wissen
pl: Wyczyść filtry
pt_br: Limpar filtros
ru: Сбросить фильтры
sv: Rensa filter
tr: Filtreleri temizle
uk: Очистити фільтри
vi: Xóa bộ lọc
zh_hans: 清除筛选
zh_hant: 清除篩選

source: Clear prompt
ar: مسح الإدخال
de: Eingabe loeschen
es: Borrar texto
fr: Effacer l'invite
he: נקה הנחיה
hi: प्रॉम्प्ट साफ़ करें
id: Hapus prompt
it: Cancella prompt
ja: プロンプトをクリア
ko: 프롬프트 지우기
nl: Prompt wissen
pl: Wyczyść prompt
pt_br: Limpar prompt
ru: Очистить ввод
sv: Rensa prompt
tr: İstemi temizle
uk: Очистити запит
vi: Xóa lời nhắc
zh_hans: 清空输入
zh_hant: 清除輸入

source: Clear search
ar: مسح البحث
de: Suche löschen
es: Borrar búsqueda
fr: Effacer la recherche
he: נקה חיפוש
hi: खोज साफ़ करें
id: Hapus pencarian
it: Cancella ricerca
ja: 検索をクリア
ko: 검색 지우기
nl: Zoekopdracht wissen
pl: Wyczyść wyszukiwanie
pt_br: Limpar busca
ru: Очистить поиск
sv: Rensa sökning
tr: Aramayı temizle
uk: Очистити пошук
vi: Xóa tìm kiếm
zh_hans: 清除搜索
zh_hant: 清除搜尋

source: Clear task & constraints
ar: مهمة واضحة وقيود محددة
de: Klare Aufgabe & Einschränkungen
es: Tarea clara y restricciones
fr: Tâche claire et contraintes
he: נקה משימה ומגבלות
hi: स्पष्ट कार्य और बाधाएं
id: Hapus tugas & batasan
it: Obiettivo chiaro e vincoli
ja: 明確なタスクと制約条件
ko: 명확한 작업 및 제약 조건
nl: Taak en beperkingen wissen
pl: Wyczyść zadanie i ograniczenia
pt_br: Tarefa clara e restrições
ru: Четкая задача и ограничения
sv: Rensa uppgift och begränsningar
tr: Görevi ve kısıtlamaları temizle
uk: Очистити завдання та обмеження
vi: Xóa nhiệm vụ và ràng buộc
zh_hans: 明确任务与约束
zh_hant: 明確任務與限制條件

source: Click 'Install...' in the toolbar to browse the catalog.
ar: انقر على 'تثبيت...' في شريط الأدوات لتصفح الكتالوج.
de: Klicken Sie in der Symbolleiste auf „Installieren...“, um den Katalog zu durchsuchen.
es: Haz clic en 'Instalar...' en la barra de herramientas para explorar el catálogo.
fr: Cliquez sur « Installer... » dans la barre d'outils pour parcourir le catalogue.
he: לחץ על 'התקן...' בסרגל הכלים כדי לעיין בקטלוג.
hi: कैटलॉग ब्राउज़ करने के लिए टूलबार में 'इंस्टॉल...' पर क्लिक करें।
id: Klik 'Instal...' di bilah alat untuk menelusuri katalog.
it: Fai clic su 'Installa...' nella barra degli strumenti per sfogliare il catalogo.
ja: ツールバーの「インストール...」をクリックしてカタログを参照してください。
ko: 카탈로그를 탐색하려면 도구 모음에서 '설치...'를 클릭하세요.
nl: Klik op 'Installeren...' in de werkbalk om de catalogus te bekijken.
pl: Kliknij 'Zainstaluj...' na pasku narzędzi, aby przeglądać katalog.
pt_br: Clique em 'Instalar...' na barra de ferramentas para navegar pelo catálogo.
ru: Нажмите «Установить...» на панели инструментов для просмотра каталога.
sv: Klicka på 'Installera...' i verktygsfältet för att bläddra i katalogen.
tr: Kataloğa göz atmak için araç çubuğundaki 'Yükle...' düğmesine tıklayın.
uk: Натисніть 'Встановити...' на панелі інструментів для перегляду каталогу.
vi: Nhấp vào 'Cài đặt...' trên thanh công cụ để duyệt danh mục.
zh_hans: 在工具栏中点击“安装...”以浏览目录。
zh_hant: 在工具列中點擊「安裝...」以瀏覽目錄。

source: Click any file to view modifications.
ar: انقر على أي ملف لعرض التعديلات.
de: Klicken Sie auf eine Datei, um die Änderungen anzuzeigen.
es: Haz clic en cualquier archivo para ver las modificaciones.
fr: Cliquez sur un fichier pour voir les modifications.
he: לחץ על קובץ כלשהו כדי לראות את השינויים.
hi: बदलाव देखने के लिए किसी भी फ़ाइल पर क्लिक करें।
id: Klik berkas mana pun untuk melihat perubahan.
it: Fai clic su un file per vedere le modifiche.
ja: 任意のファイルをクリックすると変更内容が表示されます。
ko: 파일을 클릭하면 수정 내용을 볼 수 있습니다.
nl: Klik op een bestand om de wijzigingen te bekijken.
pl: Kliknij dowolny plik, aby zobaczyć zmiany.
pt_br: Clique em qualquer arquivo para ver as modificações.
ru: Нажмите на любой файл, чтобы увидеть изменения.
sv: Klicka på en fil för att se ändringarna.
tr: Değişiklikleri görmek için herhangi bir dosyaya tıklayın.
uk: Натисніть на будь-який файл, щоб побачити зміни.
vi: Nhấp vào bất kỳ tệp nào để xem thay đổi.
zh_hans: 点击任意文件即可查看修改。
zh_hant: 點按任一檔案即可檢視修改。

source: Click to change greeting phrase
ar: انقر لتغيير عبارة الترحيب
de: Klicken, um die Begrüßung zu ändern
es: Haz clic para cambiar la frase de saludo
fr: Cliquez pour changer la phrase de salutation
he: לחץ לשינוי משפט הברכה
hi: अभिवादन बदलने के लिए क्लिक करें
id: Klik untuk mengubah frasa sapaan
it: Fai clic per cambiare la frase di saluto
ja: クリックして挨拶を変更
ko: 클릭하여 인사말 변경
nl: Klik om de begroetingszin te wijzigen
pl: Kliknij, aby zmienić powitanie
pt_br: Clique para alterar a frase de saudação
ru: Нажмите, чтобы сменить приветствие
sv: Klicka för att ändra hälsningsfras
tr: Karşılama ifadesini değiştirmek için tıklayın
uk: Натисніть, щоб змінити привітання
vi: Nhấp để đổi câu chào
zh_hans: 点击以切换问候语
zh_hant: 點擊以切換問候語

source: Close
ar: إغلاق
de: Schließen
es: Cerrar
fr: Fermer
he: סגור
hi: बंद करें
id: Tutup
it: Chiudi
ja: 閉じる
ko: 닫기
nl: Sluiten
pl: Zamknij
pt_br: Fechar
ru: Закрыть
sv: Stäng
tr: Kapat
uk: Закрити
vi: Đóng
zh_hans: 关闭
zh_hant: 關閉

source: Close Search
ar: إغلاق البحث
de: Suche schließen
es: Cerrar búsqueda
fr: Fermer la recherche
he: סגור חיפוש
hi: खोज बंद करें
id: Tutup Pencarian
it: Chiudi ricerca
ja: 検索を閉じる
ko: 검색 닫기
nl: Zoeken sluiten
pl: Zamknij wyszukiwanie
pt_br: Fechar Busca
ru: Закрыть поиск
sv: Stäng sökning
tr: Aramayı Kapat
uk: Закрити пошук
vi: Đóng tìm kiếm
zh_hans: 关闭搜索
zh_hant: 關閉搜尋

source: Close preview
ar: إغلاق المعاينة
de: Vorschau schließen
es: Cerrar vista previa
fr: Fermer l'aperçu
he: סגור תצוגה מקדימה
hi: पूर्वावलोकन बंद करें
id: Tutup pratinjau
it: Chiudi anteprima
ja: プレビューを閉じる
ko: 미리보기 닫기
nl: Voorbeeld sluiten
pl: Zamknij podgląd
pt_br: Fechar prévia
ru: Закрыть просмотр
sv: Stäng förhandsgranskning
tr: Önizlemeyi kapat
uk: Закрити перегляд
vi: Đóng bản xem trước
zh_hans: 关闭预览
zh_hant: 關閉預覽

source: Code Search & Project Indexing
ar: البحث في التعليمات البرمجية وفهرسة المشاريع
de: Codesuche und Projektindizierung
es: Búsqueda de código e indexación de proyectos
fr: Recherche de code et indexation des projets
he: חיפוש בקוד ואינדוקס פרויקטים
hi: कोड खोज और प्रोजेक्ट इंडेक्सिंग
id: Pencarian kode dan pengindeksan proyek
it: Ricerca nel codice e indicizzazione dei progetti
ja: コード検索とプロジェクトのインデックス作成
ko: 코드 검색 및 프로젝트 인덱싱
nl: Code zoeken en projectindexering
pl: Wyszukiwanie kodu i indeksowanie projektów
pt_br: Pesquisa de código e indexação de projetos
ru: Поиск по коду и индексация проектов
sv: Kodsökning och projektindexering
tr: Kod arama ve proje dizinleme
uk: Пошук у коді та індексування проєктів
vi: Tìm kiếm mã và lập chỉ mục dự án
zh_hans: 代码搜索与项目索引
zh_hant: 程式碼搜尋與專案索引

source: Code Search Index (Syntext)
ar: فهرس البحث في التعليمات البرمجية (Syntext)
de: Codesuchindex (Syntext)
es: Índice de búsqueda de código (Syntext)
fr: Index de recherche de code (Syntext)
he: אינדקס חיפוש קוד (Syntext)
hi: कोड खोज इंडेक्स (Syntext)
id: Indeks pencarian kode (Syntext)
it: Indice di ricerca del codice (Syntext)
ja: コード検索インデックス (Syntext)
ko: 코드 검색 인덱스(Syntext)
nl: Codezoekindex (Syntext)
pl: Indeks wyszukiwania kodu (Syntext)
pt_br: Índice de pesquisa de código (Syntext)
ru: Индекс поиска по коду (Syntext)
sv: Kodsökningsindex (Syntext)
tr: Kod arama dizini (Syntext)
uk: Індекс пошуку в коді (Syntext)
vi: Chỉ mục tìm kiếm mã (Syntext)
zh_hans: 代码搜索索引 (Syntext)
zh_hant: 程式碼搜尋索引 (Syntext)

source: Code indexing is disabled globally (Settings > General).
ar: فهرسة التعليمات البرمجية معطلة بشكل عام (الإعدادات > عام).
de: Die Codeindizierung ist global deaktiviert (Einstellungen > Allgemein).
es: La indexación de código está desactivada globalmente (Ajustes > General).
fr: L'indexation du code est désactivée globalement (Réglages > Général).
he: אינדוקס הקוד מושבת באופן כללי (הגדרות > כללי).
hi: कोड इंडेक्सिंग पूरे ऐप में बंद है (सेटिंग्स > सामान्य)।
id: Pengindeksan kode dinonaktifkan secara global (Pengaturan > Umum).
it: L'indicizzazione del codice è disattivata globalmente (Impostazioni > Generali).
ja: コードのインデックス作成は全体設定で無効です (設定 > 一般)。
ko: 코드 인덱싱이 전역에서 비활성화되어 있습니다(설정 > 일반).
nl: Code-indexering is algemeen uitgeschakeld (Instellingen > Algemeen).
pl: Indeksowanie kodu jest globalnie wyłączone (Ustawienia > Ogólne).
pt_br: A indexação de código está desativada globalmente (Ajustes > Geral).
ru: Индексация кода отключена глобально (Настройки > Основные).
sv: Kodindexering är globalt inaktiverad (Inställningar > Allmänt).
tr: Kod dizinleme genel olarak devre dışı (Ayarlar > Genel).
uk: Індексування коду вимкнено глобально (Налаштування > Загальні).
vi: Lập chỉ mục mã đã bị tắt trên toàn cục (Cài đặt > Chung).
zh_hans: 代码索引已在全局设置中停用（设置 > 通用）。
zh_hant: 程式碼索引已在全域設定中停用（設定 > 一般）。

source: Codebase Import & Detection
ar: استيراد قاعدة الشفرة واكتشافها
de: Codebase-Import und -Erkennung
es: Importación y detección del código
fr: Importation et détection du code
he: ייבוא וזיהוי של בסיס הקוד
hi: कोडबेस आयात और पहचान
id: Impor dan deteksi basis kode
it: Importazione e rilevamento del codice
ja: コードベースのインポートと検出
ko: 코드베이스 가져오기 및 감지
nl: Codebase importeren en detecteren
pl: Import i wykrywanie kodu
pt_br: Importação e detecção do código
ru: Импорт и обнаружение кода
sv: Import och identifiering av kodbas
tr: Kod tabanı içe aktarma ve algılama
uk: Імпорт і виявлення коду
vi: Nhập và phát hiện mã nguồn
zh_hans: 代码库导入与检测
zh_hant: 程式碼庫匯入與偵測

source: Codebase Root Directory
ar: الدليل الجذري لقاعدة الشفرة
de: Codebase-Stammverzeichnis
es: Directorio raíz del código
fr: Répertoire racine du code
he: תיקיית השורש של בסיס הקוד
hi: कोडबेस रूट डायरेक्टरी
id: Direktori root basis kode
it: Directory radice del codice
ja: コードベースのルートディレクトリ
ko: 코드베이스 루트 디렉터리
nl: Hoofdmap van codebase
pl: Katalog główny kodu
pt_br: Diretório raiz do código
ru: Корневой каталог кода
sv: Kodbasens rotkatalog
tr: Kod tabanı kök dizini
uk: Кореневий каталог коду
vi: Thư mục gốc mã nguồn
zh_hans: 代码库根目录
zh_hant: 程式碼庫根目錄

source: Coding Agents
ar: وكلاء البرمجة
de: Coding-Agenten
es: Agentes de programación
fr: Agents de programmation
he: סוכני תכנות
hi: कोडिंग एजेंट्स
id: Agen Pengkodean
it: Agenti di programmazione
ja: コーディングエージェント
ko: 코딩 에이전트
nl: Codeeragenten
pl: Agenci kodujący
pt_br: Agentes de Programação
ru: Агенты программирования
sv: Kodningsagenter
tr: Kodlama Ajanları
uk: Агенти програмування
vi: Đại lý lập trình
zh_hans: 编码智能体
zh_hant: 程式設計代理

source: Collapse finished turns
ar: طي الجولات المكتملة
de: Beendete Runden einklappen
es: Contraer turnos finalizados
fr: Réduire les tours terminés
he: כווץ תורות שהסתיימו
hi: समाप्त मोड़ संक्षिप्त करें
id: Ciutkan giliran yang selesai
it: Comprimi turni completati
ja: 完了したターンを折りたたむ
ko: 완료된 턴 접기
nl: Voltooide beurten samenvouwen
pl: Zwiń ukończone tury
pt_br: Recolher turnos finalizados
ru: Свернуть завершенные ходы
sv: Fäll ihop avslutade omgångar
tr: Tamamlanan sıraları daralt
uk: Згорнути завершені ходи
vi: Thu gọn các lượt đã hoàn thành
zh_hans: 折叠已完成的轮次
zh_hant: 摺疊已完成的輪次

source: Collapse turn
ar: طي الجولة
de: Runde einklappen
es: Contraer turno
fr: Réduire le tour
he: כווץ תור
hi: मोड़ संक्षिप्त करें
id: Ciutkan giliran
it: Comprimi turno
ja: ターンを折りたたむ
ko: 턴 접기
nl: Beurt samenvouwen
pl: Zwiń turę
pt_br: Recolher turno
ru: Свернуть ход
sv: Fäll ihop omgång
tr: Sırayı daralt
uk: Згорнути хід
vi: Thu gọn lượt
zh_hans: 折叠轮次
zh_hant: 摺疊輪次

source: Collapsed
ar: مطوي
de: Eingeklappt
es: Contraído
fr: Replié
he: מכווץ
hi: संक्षिप्त
id: Diciutkan
it: Compresso
ja: 折りたたみ
ko: 접힘
nl: Ingeklapt
pl: Zwinięte
pt_br: Recolhido
ru: Свёрнуто
sv: Hopfälld
tr: Daraltılmış
uk: Згорнуто
vi: Đã thu gọn
zh_hans: 已折叠
zh_hant: 已收合

source: Command Classifier Veto
ar: فيتو مصنف الأوامر
de: Befehlsklassifikator-Veto
es: Veto del clasificador de comandos
fr: Veto du classificateur de commandes
he: וטו מסווג פקודות
hi: कमांड क्लासिफायर वीटो
id: Veto Pengklasifikasi Perintah
it: Veto classificatore comandi
ja: コマンド分類器の拒否
ko: 명령 분류기 거부
nl: Veto van opdrachtclassificatie
pl: Weto klasyfikatora poleceń
pt_br: Veto do Classificador de Comandos
ru: Вето классификатора команд
sv: Veto för kommandoklassificerare
tr: Komut Sınıflandırıcı Vetosu
uk: Вето класифікатора команд
vi: Phủ quyết phân loại lệnh
zh_hans: 命令分类器否决
zh_hant: 命令分類器否決

source: Commit your changes to view the project timeline.
ar: نفّذ إيداع تغييراتك لعرض المخطط الزمني للمشروع.
de: Committen Sie Ihre Änderungen, um die Projektchronik anzuzeigen.
es: Confirma tus cambios para ver la cronología del proyecto.
fr: Validez vos modifications pour afficher la chronologie du projet.
he: בצע קומיט לשינויים שלך כדי להציג את ציר הזמן של הפרויקט.
hi: प्रोजेक्ट टाइमलाइन देखने के लिए अपने बदलाव कमिट करें।
id: Commit perubahan Anda untuk melihat linimasa proyek.
it: Esegui il commit delle modifiche per visualizzare la cronologia del progetto.
ja: 変更をコミットすると、プロジェクトのタイムラインが表示されます。
ko: 변경 사항을 커밋하면 프로젝트 타임라인을 볼 수 있습니다.
nl: Commit je wijzigingen om de projecttijdlijn te bekijken.
pl: Zatwierdź swoje zmiany, aby zobaczyć oś czasu projektu.
pt_br: Faça commit das suas alterações para ver a linha do tempo do projeto.
ru: Зафиксируйте изменения, чтобы увидеть хронологию проекта.
sv: Checka in dina ändringar för att se projektets tidslinje.
tr: Proje zaman çizelgesini görmek için değişikliklerinizi işleyin.
uk: Зафіксуйте зміни, щоб переглянути хронологію проєкту.
vi: Commit các thay đổi của bạn để xem dòng thời gian dự án.
zh_hans: 提交你的更改以查看项目时间线。
zh_hant: 提交你的變更以檢視專案時間軸。

source: Commits >
ar: الالتزامات >
he: התחייבויות >
hi: कमिट >
id: Komit >
it: Commit >
ja: コミット >
ko: 커밋 >
pl: Zatwierdzenia >
ru: Коммиты >
sv: Incheckningar >
tr: İşlemeler >
uk: Коміти >
vi: Cam kết >
zh_hans: 提交 >
zh_hant: 提交 >

source: Compact at completed todo boundaries
ar: ضغط عند حدود المهام المكتملة
de: An Grenzen abgeschlossener Aufgaben komprimieren
es: Compactar al completar tareas pendientes
fr: Compacter aux limites des tâches terminées
he: דחוס בגבולות משימות שהושלמו
hi: पूरे किए गए कार्य सीमाओं पर संकुचित करें
id: Padatkan pada batas tugas yang sudah selesai
it: Compatta ai limiti delle attività completate
ja: 完了したタスクの境界で圧縮
ko: 완료된 할 일 경계에서 압축
nl: Comprimeren bij voltooide todo-grenzen
pl: Kompaktuj na granicach ukończonych zadań
pt_br: Compactar nos limites de tarefas concluídas
ru: Компактифицировать по границам завершенных задач
sv: Komprimera vid gränser för slutförda uppgifter
tr: Tamamlanan yapılacaklar sınırlarında sıkıştır
uk: Компактифікувати на межах виконаних завдань
vi: Nén tại ranh giới công việc đã hoàn thành
zh_hans: 在已完成的待办事项边界压缩
zh_hant: 在已完成的待辦事項邊界壓縮

source: Compacting conversation...
ar: جارٍ ضغط المحادثة...
de: Unterhaltung wird verdichtet...
es: Compactando la conversación...
fr: Compactage de la conversation...
he: דוחס את השיחה...
hi: बातचीत संक्षिप्त की जा रही है...
id: Memadatkan percakapan...
it: Compattazione della conversazione...
ja: 会話を圧縮しています...
ko: 대화를 압축하는 중...
nl: Gesprek comprimeren...
pl: Kompaktowanie rozmowy...
pt_br: Compactando a conversa...
ru: Сжатие беседы...
sv: Komprimerar konversationen...
tr: Sohbet sıkıştırılıyor...
uk: Стиснення розмови...
vi: Đang nén cuộc trò chuyện...
zh_hans: 正在压缩对话...
zh_hant: 正在壓縮對話...

source: Compare against...
ar: مقارنة مع...
de: Vergleichen mit...
es: Comparar con...
fr: Comparer à...
he: השווה מול...
hi: से तुलना करें...
id: Bandingkan dengan...
it: Confronta con...
ja: 比較対象...
ko: 비교 대상...
nl: Vergelijken met...
pl: Porównaj z...
pt_br: Comparar com...
ru: Сравнить с...
sv: Jämför med...
tr: Şununla karşılaştır...
uk: Порівняти з...
vi: So sánh với...
zh_hans: 对比...
zh_hant: 比較...

source: Comparison Target
ar: هدف المقارنة
de: Vergleichsziel
es: Destino de comparación
fr: Cible de comparaison
he: יעד השוואה
hi: तुलना लक्ष्य
id: Target Perbandingan
it: Destinazione di confronto
ja: 比較対象
ko: 비교 대상
nl: Vergelijkingsdoel
pl: Cel porównania
pt_br: Alvo de comparação
ru: Цель сравнения
sv: Jämförelsemål
tr: Karşılaştırma Hedefi
uk: Ціль порівняння
vi: Mục tiêu so sánh
zh_hans: 对比目标
zh_hant: 對比目標

source: Completed
ar: مكتمل
de: Abgeschlossen
es: Completado
fr: Terminé
he: הושלם
hi: पूर्ण
id: Selesai
it: Completato
ja: 完了
ko: 완료됨
nl: Voltooid
pl: Ukończono
pt_br: Concluído
ru: Завершено
sv: Slutförd
tr: Tamamlandı
uk: Завершено
vi: Đã hoàn thành
zh_hans: 已完成
zh_hant: 已完成

source: Configuration
ar: الإعدادات
de: Konfiguration
es: Configuración
he: תצורה
hi: कॉन्फ़िगरेशन
id: Konfigurasi
it: Configurazione
ja: 構成
ko: 구성
nl: Configuratie
pl: Konfiguracja
pt_br: Configuração
ru: Конфигурация
sv: Konfiguration
tr: Yapılandırma
uk: Конфігурація
vi: Cấu hình
zh_hans: 配置
zh_hant: 組態

source: Configure
ar: تهيئة
de: Konfigurieren
es: Configurar
fr: Configurer
he: הגדרה
hi: कॉन्फ़िगर करें
id: Konfigurasi
it: Configurare
ja: 設定する
ko: 구성
nl: Configureren
pl: Konfiguruj
pt_br: Configurar
ru: Настроить
sv: Konfigurera
tr: Yapılandır
uk: Налаштувати
vi: Cấu hình
zh_hans: 配置
zh_hant: 設定

source: Configure Model Context Protocol server parameters and execution transport.
ar: اضبط معلمات خادم Model Context Protocol ووسيلة نقل التنفيذ.
de: Konfigurieren Sie die Parameter des Model-Context-Protocol-Servers und den Ausführungstransport.
es: Configura los parámetros del servidor Model Context Protocol y el transporte de ejecución.
fr: Configurez les paramètres du serveur Model Context Protocol et le transport d'exécution.
he: הגדר את פרמטרי שרת Model Context Protocol ואת אמצעי ההעברה לביצוע.
hi: Model Context Protocol सर्वर पैरामीटर और निष्पादन ट्रांसपोर्ट कॉन्फ़िगर करें।
id: Konfigurasikan parameter server Model Context Protocol dan transport eksekusi.
it: Configura i parametri del server Model Context Protocol e il trasporto di esecuzione.
ja: Model Context Protocol サーバーのパラメータと実行トランスポートを設定します。
ko: Model Context Protocol 서버 매개변수와 실행 전송 방식을 구성합니다.
nl: Configureer de parameters van de Model Context Protocol-server en het uitvoeringstransport.
pl: Skonfiguruj parametry serwera Model Context Protocol i transport wykonywania.
pt_br: Configure os parâmetros do servidor Model Context Protocol e o transporte de execução.
ru: Настройте параметры сервера Model Context Protocol и транспорт выполнения.
sv: Konfigurera parametrar för Model Context Protocol-servern och exekveringstransporten.
tr: Model Context Protocol sunucu parametrelerini ve yürütme aktarımını yapılandırın.
uk: Налаштуйте параметри сервера Model Context Protocol і транспорт виконання.
vi: Cấu hình tham số máy chủ Model Context Protocol và phương thức truyền tải thực thi.
zh_hans: 配置 Model Context Protocol 服务器参数和执行传输方式。
zh_hant: 設定 Model Context Protocol 伺服器參數與執行傳輸方式。

source: Configure deterministic actions, guardrails, and lifecycle event handlers.
ar: اضبط الإجراءات الحتمية وحواجز الحماية ومعالجات أحداث دورة الحياة.
de: Konfigurieren Sie deterministische Aktionen, Schutzmechanismen und Handler für Lebenszyklusereignisse.
es: Configura acciones deterministas, salvaguardas y gestores de eventos del ciclo de vida.
fr: Configurez des actions déterministes, des garde-fous et des gestionnaires d'événements de cycle de vie.
he: הגדר פעולות דטרמיניסטיות, מעקות בטיחות ומטפלי אירועי מחזור חיים.
hi: नियतात्मक क्रियाएं, गार्डरेल और लाइफ़साइकल इवेंट हैंडलर कॉन्फ़िगर करें।
id: Konfigurasikan tindakan deterministik, pagar pengaman, dan penangan peristiwa siklus hidup.
it: Configura azioni deterministiche, protezioni e gestori di eventi del ciclo di vita.
ja: 決定的なアクション、ガードレール、ライフサイクルイベントハンドラを設定します。
ko: 결정적 동작, 가드레일, 수명 주기 이벤트 핸들러를 구성합니다.
nl: Configureer deterministische acties, vangrails en handlers voor levenscyclusgebeurtenissen.
pl: Skonfiguruj deterministyczne akcje, zabezpieczenia i obsługę zdarzeń cyklu życia.
pt_br: Configure ações determinísticas, proteções e manipuladores de eventos de ciclo de vida.
ru: Настройте детерминированные действия, ограничители и обработчики событий жизненного цикла.
sv: Konfigurera deterministiska åtgärder, skyddsräcken och hanterare för livscykelhändelser.
tr: Belirlenimci eylemleri, koruma kurallarını ve yaşam döngüsü olay işleyicilerini yapılandırın.
uk: Налаштуйте детерміновані дії, запобіжники та обробники подій життєвого циклу.
vi: Cấu hình các hành động tất định, rào chắn an toàn và trình xử lý sự kiện vòng đời.
zh_hans: 配置确定性操作、防护规则和生命周期事件处理程序。
zh_hant: 設定確定性動作、防護規則與生命週期事件處理常式。

source: Configure environment variables and options for %@.
ar: تكوين متغيرات البيئة والخيارات لـ %@.
de: Konfigurieren Sie Umgebungsvariablen und Optionen für %@.
es: Configura variables de entorno y opciones para %@.
fr: Configurez les variables d'environnement et les options pour %@.
he: הגדר משתני סביבה ואפשרויות עבור %@.
hi: %@ के लिए पर्यावरण चर और विकल्प कॉन्फ़िगर करें।
id: Konfigurasikan variabel lingkungan dan opsi untuk %@.
it: Configura le variabili di ambiente e le opzioni per %@.
ja: %@ の環境変数とオプションを設定します。
ko: %@의 환경 변수 및 옵션을 구성합니다.
nl: Configureer omgevingsvariabelen en opties voor %@.
pl: Skonfiguruj zmienne środowiskowe i opcje dla %@.
pt_br: Configure variáveis de ambiente e opções para %@.
ru: Настройте переменные окружения и параметры для %@.
sv: Konfigurera miljövariabler och alternativ för %@.
tr: %@ için ortam değişkenlerini ve seçeneklerini yapılandırın.
uk: Налаштуйте змінні середовища та параметри для %@.
vi: Định cấu hình các biến môi trường và tùy chọn cho %@.
zh_hans: 为 %@ 配置环境变量和选项。
zh_hant: 為 %@ 配置環境變數和選項。

source: Configured
ar: مضبوط
de: Konfiguriert
es: Configurado
fr: Configuré
he: מוגדר
hi: कॉन्फ़िगर किया गया
id: Terkonfigurasi
it: Configurato
ja: 設定済み
ko: 구성됨
nl: Geconfigureerd
pl: Skonfigurowano
pt_br: Configurado
ru: Настроено
sv: Konfigurerad
tr: Yapılandırıldı
uk: Налаштовано
vi: Đã cấu hình
zh_hans: 已配置
zh_hant: 已設定

source: Conflict Preference
ar: تفضيل التعارض
de: Konfliktpräferenz
es: Preferencia ante conflictos
fr: Préférence en cas de conflit
he: העדפה במקרה התנגשות
hi: विरोध वरीयता
id: Preferensi konflik
it: Preferenza in caso di conflitto
ja: 競合時の設定
ko: 충돌 시 기본 설정
nl: Voorkeur bij conflicten
pl: Preferencja przy konfliktach
pt_br: Preferência em conflitos
ru: Предпочтение при конфликтах
sv: Inställning vid konflikt
tr: Çakışma tercihi
uk: Перевага при конфліктах
vi: Tùy chọn khi xung đột
zh_hans: 冲突处理偏好
zh_hant: 衝突處理偏好

source: Connect Terminal Agents:
ar: توصيل وكلاء الطرفية:
de: Terminal-Agents verbinden:
es: Conectar agentes de terminal:
fr: Connecter des agents de terminal :
he: חבר סוכני מסוף:
hi: टर्मिनल एजेंट कनेक्ट करें:
id: Hubungkan agen terminal:
it: Connetti agenti da terminale:
ja: ターミナルエージェントを接続:
ko: 터미널 에이전트 연결:
nl: Terminal-agents verbinden:
pl: Połącz agentów terminala:
pt_br: Conectar agentes de terminal:
ru: Подключить терминальные агенты:
sv: Anslut terminalagenter:
tr: Uçbirim aracılarını bağla:
uk: Підключити термінальні агенти:
vi: Kết nối tác nhân dòng lệnh:
zh_hans: 连接终端代理:
zh_hant: 連接終端機代理:
